
## Plan Result (sandbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 6 to change, 8 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.test-secret
* Update
  * azurerm_key_vault_secret.POSTGRES-USER-V14
  * azurerm_key_vault_secret.POSTGRES_DATABASE-V14
  * azurerm_key_vault_secret.POSTGRES_HOST-V14
  * azurerm_key_vault_secret.POSTGRES_PORT-V14
  * module.postgresql_flexible.azurerm_resource_group.rg[0]
  * module.postgresql_flexible.random_password.password
* Delete
  * module.plum-redis-storage.azurerm_private_endpoint.this[0]
  * module.plum-redis-storage.azurerm_redis_cache.redis
  * module.plum-redis-storage.azurerm_resource_group.cache-resourcegroup[0]
  * module.plum-redis-storage.azurerm_storage_account.backup[0]
* Replace
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;plum&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;rhubarb&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-USER-V14 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER-V14" {
        id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-USER-v14/8120c2cf7e42406a9851860d67d6ea32"
        name                    = "recipe-backend-POSTGRES-USER-v14"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-V14 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-V14" {
        id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-DATABASE-V14/80466c365a504d60a37f0e5fe15692c5"
        name                    = "recipe-backend-POSTGRES-DATABASE-V14"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-V14 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-V14" {
        id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-HOST-V14/5b23524840694feda32359f8be344fbe"
        name                    = "recipe-backend-POSTGRES-HOST-V14"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-V14 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_PORT-V14" {
        id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-PORT-V14/982d1a143e4343c28f8618af5f203e66"
        name                    = "recipe-backend-POSTGRES-PORT-V14"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.test-secret will be created
  + resource "azurerm_key_vault_secret" "test-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox"
      + name                    = "test-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.plum-redis-storage.azurerm_private_endpoint.this[0] will be destroyed
  # (because azurerm_private_endpoint.this is not in configuration)
  - resource "azurerm_private_endpoint" "this" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox" -> null
      - location                 = "uksouth" -> null
      - name                     = "crumble-recipe-backend-session-storage-sandbox" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/networkInterfaces/crumble-recipe-backend-session-storage-sand.nic.e8567369-1005-47bd-8653-6a20a625c8d6"
              - name = "crumble-recipe-backend-session-storage-sand.nic.e8567369-1005-47bd-8653-6a20a625c8d6"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "crumble-recipe-backend-session-storage-sandbox.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.100.136.5",
                        ]
                      - name         = "crumble-recipe-backend-session-storage-sandbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "crumble-recipe-backend-session-storage-cache-sandbox" -> null
      - subnet_id                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox/subnets/core-infra-subnet-2-sandbox" -> null
      - tags                     = {
          - "application"         = "core"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#platops-help"
          - "environment"         = "sandbox"
          - "expiresAfter"        = "2024-05-19"
          - "managedBy"           = "CNP"
          - "startupMode"         = "onDemand"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> null
          - name                 = "redis-endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "crumble-recipe-backend-session-storage-sandbox" -> null
          - private_connection_resource_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox" -> null
          - private_ip_address             = "10.100.136.5" -> null
          - subresource_names              = [
              - "redisCache",
            ] -> null
        }
    }

  # module.plum-redis-storage.azurerm_redis_cache.redis will be destroyed
  # (because azurerm_redis_cache.redis is not in configuration)
  - resource "azurerm_redis_cache" "redis" {
      - capacity                      = 1 -> null
      - enable_non_ssl_port           = false -> null
      - family                        = "P" -> null
      - hostname                      = "crumble-recipe-backend-session-storage-sandbox.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox" -> null
      - location                      = "uksouth" -> null
      - minimum_tls_version           = "1.2" -> null
      - name                          = "crumble-recipe-backend-session-storage-sandbox" -> null
      - port                          = 6379 -> null
      - primary_access_key            = (sensitive value) -> null
      - primary_connection_string     = (sensitive value) -> null
      - public_network_access_enabled = false -> null
      - redis_version                 = "6.0" -> null
      - replicas_per_master           = 0 -> null
      - replicas_per_primary          = 0 -> null
      - resource_group_name           = "crumble-recipe-backend-session-storage-cache-sandbox" -> null
      - secondary_access_key          = (sensitive value) -> null
      - secondary_connection_string   = (sensitive value) -> null
      - shard_count                   = 0 -> null
      - sku_name                      = "Premium" -> null
      - ssl_port                      = 6380 -> null
      - tags                          = {
          - "application"         = "core"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#platops-help"
          - "environment"         = "sandbox"
          - "expiresAfter"        = "2024-05-19"
          - "managedBy"           = "CNP"
          - "startupMode"         = "onDemand"
        } -> null
      - tenant_settings               = {} -> null
      - zones                         = [] -> null

      - redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          - data_persistence_authentication_method  = "SAS" -> null
          - enable_authentication                   = true -> null
          - maxclients                              = 7500 -> null
          - maxfragmentationmemory_reserved         = 642 -> null
          - maxmemory_delta                         = 642 -> null
          - maxmemory_policy                        = "volatile-lru" -> null
          - maxmemory_reserved                      = 642 -> null
          - rdb_backup_enabled                      = true -> null
          - rdb_backup_frequency                    = 360 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
          - rdb_storage_connection_string           = (sensitive value) -> null
        }
    }

  # module.plum-redis-storage.azurerm_resource_group.cache-resourcegroup[0] will be destroyed
  # (because azurerm_resource_group.cache-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "cache-resourcegroup" {
      - id       = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox" -> null
      - location = "uksouth" -> null
      - name     = "crumble-recipe-backend-session-storage-cache-sandbox" -> null
      - tags     = {
          - "application"         = "core"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#platops-help"
          - "environment"         = "sandbox"
          - "expiresAfter"        = "2024-05-19"
          - "managedBy"           = "CNP"
          - "startupMode"         = "onDemand"
        } -> null
    }

  # module.plum-redis-storage.azurerm_storage_account.backup[0] will be destroyed
  # (because azurerm_storage_account.backup is not in configuration)
  - resource "azurerm_storage_account" "backup" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "GRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = true -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - dns_endpoint_type                 = "Standard" -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Storage/storageAccounts/crumblesandboxredissa" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - local_user_enabled                = true -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "crumblesandboxredissa" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://crumblesandboxredissa.blob.core.windows.net/" -> null
      - primary_blob_host                 = "crumblesandboxredissa.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://crumblesandboxredissa.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "crumblesandboxredissa.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://crumblesandboxredissa.file.core.windows.net/" -> null
      - primary_file_host                 = "crumblesandboxredissa.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://crumblesandboxredissa.queue.core.windows.net/" -> null
      - primary_queue_host                = "crumblesandboxredissa.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://crumblesandboxredissa.table.core.windows.net/" -> null
      - primary_table_host                = "crumblesandboxredissa.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://crumblesandboxredissa.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "crumblesandboxredissa.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "crumble-recipe-backend-session-storage-cache-sandbox" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_location                = "ukwest" -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"         = "core"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#platops-help"
          - "environment"         = "sandbox"
          - "expiresAfter"        = "2024-05-19"
          - "managedBy"           = "CNP"
          - "startupMode"         = "onDemand"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "crumble-v14-flexible-sandbox.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox" -> (known after apply)
        name                          = "crumble-v14-flexible-sandbox"
      ~ public_network_access_enabled = false -> (known after apply)
      ~ storage_tier                  = "P6" -> (known after apply)
      ~ tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2024-05-19" -> "2024-05-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
      ~ version                       = "16" -> "15" # forces replacement
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["plum"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox/databases/plum" -> (known after apply)
        name      = "plum"
      ~ server_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["rhubarb"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox/databases/rhubarb" -> (known after apply)
        name      = "rhubarb"
      ~ server_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox"
        name     = "crumble-v14-flexible-data-sandbox"
      ~ tags     = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2024-05-19" -> "2024-05-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.random_password.password will be updated in-place
  ~ resource "random_password" "password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

Plan: 5 to add, 6 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":951,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->